adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51J20A.PIC
      <edc:SFRDef edc:_addr="0x4300241E" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESULT1" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="RESULT" edc:desc="Filter Result" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002420" edc:offset="0x3E0"/>
      <edc:SFRDef edc:_addr="0x43002800" edc:access="--nnnnnn" edc:cname="CTRLA" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="I2S">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEN0" edc:desc="Clock Unit 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEN1" edc:desc="Clock Unit 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Tx Serializer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Rx Serializer Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002801" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x43002804" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLKCTRL0" edc:impl="0x3F3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="I2S">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SLOTSIZE" edc:desc="Slot Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSLOTS" edc:desc="Number of Slots in Frame" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FSWIDTH" edc:desc="Frame Sync Width" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SLOT" edc:desc="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Frame Sync Pulse is half a Frame wide" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BIT" edc:desc="Frame Sync Pulse is 1 Bit wide" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITDELAY" edc:desc="Data Delay from Frame Sync" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LJ" edc:desc="Left Justified (0 Bit Delay)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="I2S" edc:desc="I2S (1 Bit Delay)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSSEL" edc:desc="Frame Sync Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SCKDIV" edc:desc="Divided Serial Clock n is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FSPIN" edc:desc="FSn input pin is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSINV" edc:desc="Frame Sync Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSOUTINV" edc:desc="Frame Sync Output Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCKSEL" edc:desc="Serial Clock Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MCKDIV" edc:desc="Divided Master Clock n is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SCKPIN" edc:desc="SCKn input pin is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCKOUTINV" edc:desc="Serial Clock Output Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKSEL" edc:desc="Master Clock Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK_I2S_n is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCKPIN" edc:desc="MCKn input pin is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MCKEN" edc:desc="Master Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKOUTINV" edc:desc="Master Clock Output Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKDIV" edc:desc="Master Clock Division Factor" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKOUTDIV" edc:desc="Master Clock Output Division Factor" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002808" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLKCTRL1" edc:impl="0x3F3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="I2S">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SLOTSIZE" edc:desc="Slot Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSLOTS" edc:desc="Number of Slots in Frame" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FSWIDTH" edc:desc="Frame Sync Width" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SLOT" edc:desc="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Frame Sync Pulse is half a Frame wide" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BIT" edc:desc="Frame Sync Pulse is 1 Bit wide" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITDELAY" edc:desc="Data Delay from Frame Sync" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LJ" edc:desc="Left Justified (0 Bit Delay)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="I2S" edc:desc="I2S (1 Bit Delay)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSSEL" edc:desc="Frame Sync Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SCKDIV" edc:desc="Divided Serial Clock n is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FSPIN" edc:desc="FSn input pin is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSINV" edc:desc="Frame Sync Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSOUTINV" edc:desc="Frame Sync Output Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCKSEL" edc:desc="Serial Clock Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MCKDIV" edc:desc="Divided Master Clock n is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SCKPIN" edc:desc="SCKn input pin is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCKOUTINV" edc:desc="Serial Clock Output Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKSEL" edc:desc="Master Clock Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK_I2S_n is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCKPIN" edc:desc="MCKn input pin is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MCKEN" edc:desc="Master Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKOUTINV" edc:desc="Master Clock Output Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKDIV" edc:desc="Master Clock Division Factor" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKOUTDIV" edc:desc="Master Clock Output Division Factor" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300280C" edc:access="--nn--nn--nn--nn" edc:cname="INTENCLR" edc:impl="0x3333" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="I2S">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:desc="Receive Ready 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:desc="Receive Ready 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:desc="Receive Overrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:desc="Receive Overrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:desc="Transmit Underrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:desc="Transmit Underrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4300280E" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x43002810" edc:access="--nn--nn--nn--nn" edc:cname="INTENSET" edc:impl="0x3333" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="I2S">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:desc="Receive Ready 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:desc="Receive Ready 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:desc="Receive Overrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:desc="Receive Overrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:desc="Transmit Underrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:desc="Transmit Underrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002812" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x43002814" edc:access="--nn--nn--nn--nn" edc:cname="INTFLAG" edc:impl="0x3333" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="I2S">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:desc="Receive Ready 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:desc="Receive Ready 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:desc="Receive Overrun 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:desc="Receive Overrun 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:desc="Transmit Underrun 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:desc="Transmit Underrun 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
