adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51J20A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA04" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB09" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="OUT2" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA0" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="DEN2" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="M"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X28" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y28" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA8" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN9" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="CS" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="FS1" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA3" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDDAT2" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="SDO" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA09" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA1" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDDAT0" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="FS0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA06" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA07" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="CLK" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="XIN0" edc:ppsfunction="XIN0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="XOUT0" edc:ppsfunction="XOUT0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X29" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y29" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA9" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN10" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X27" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y27" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="MCK1" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO7" edc:ppsfunction="M"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X26" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y26" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="M"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDDAT3" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="SDI" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN11" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA2" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDDAT1" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA08" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDCMD" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="MCK0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="N"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
